In [65]:
import numpy as np
import pandas as pd
from PIL import Image

In [66]:
df_stun = pd.read_excel(
    '/home/rmfarizky/Project/Stunting/LAPORAN_PEMANTAUAN__POSYANDU_2023.xlsx',
    sheet_name='Merged'
    )

print('Data downloaded and read into a dataframe!')

Data downloaded and read into a dataframe!

In [67]:
df_stun.head()

   No      nama_anak TANGGAL LAHIR TANGGALUKUR  BERAT TINGGI  LILA  KETERANGAN
0   1  Arlan Saputra   2018-04-03   2023-01-24   13.1   97.5  14.7         NaN
1   2   Anggun Laili   2018-05-06   2023-01-24   12.2   98.5  14.5         NaN
2   3   Sivaul Qolbi   2018-06-06   2023-01-24   12.6   95.5  14.7         NaN
3   4           Rael   2018-07-03   2023-01-24   14.2   99.3  15.0         NaN
4   5  SILVIA ANJANI   2018-08-18   2023-01-24   13.2     97  14.7         NaN

In [68]:
df_stun.drop(['No'],axis=1, inplace=True)

In [69]:
df_stun.columns

Index(['nama_anak', 'TANGGAL LAHIR', 'TANGGALUKUR', 'BERAT', 'TINGGI', 'LILA',
       'KETERANGAN'],
      dtype='object')

In [70]:
df_stun.rename(columns={'TANGGAL LAHIR':'tgl_lahir', 'TANGGALUKUR': 'tgl_ukur','BERAT':'berat', 'TINGGI':'tinggi', 'LILA':'lila','KETERANGAN': 'ket'}, 
        inplace=True)
df_stun.columns

Index(['nama_anak', 'tgl_lahir', 'tgl_ukur', 'berat', 'tinggi', 'lila', 'ket'], dtype='object')

In [71]:
df_stun.head()

       nama_anak    tgl_lahir   tgl_ukur  berat tinggi  lila  ket
0  Arlan Saputra  2018-04-03  2023-01-24   13.1   97.5  14.7  NaN
1   Anggun Laili  2018-05-06  2023-01-24   12.2   98.5  14.5  NaN
2   Sivaul Qolbi  2018-06-06  2023-01-24   12.6   95.5  14.7  NaN
3           Rael  2018-07-03  2023-01-24   14.2   99.3  15.0  NaN
4  SILVIA ANJANI  2018-08-18  2023-01-24   13.2     97  14.7  NaN

In [113]:
df_stun.isnull().sum()

nama_anak      0
tgl_lahir      0
tgl_ukur       0
berat          0
tinggi         0
lila          35
ket          624
dtype: int64

In [73]:
df_stun['tgl_ukur'].fillna(method='ffill', inplace=True)

/tmp/ipykernel_8369/2215010242.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_stun['tgl_ukur'].fillna(method='ffill', inplace=True)

In [89]:
df_stun['berat'].isnull().sum()

1

In [104]:
for index, value in enumerate(df_stun['berat']):
    if pd.isna(value):
        print(f"Missing value at index {index}: {value}")

Missing value at index 512: nan

In [110]:
df_stun.iloc[512]

nama_anak          Aldi Hermawan
tgl_lahir            2018-02-05
tgl_ukur     2023-01-10 00:00:00
berat                        NaN
tinggi                      97.3
lila                        13.4
ket                          NaN
Name: 512, dtype: object

In [111]:
df_stun = df_stun.drop(512)

In [112]:
df_stun

              nama_anak    tgl_lahir   tgl_ukur  berat tinggi  lila  ket
0         Arlan Saputra  2018-04-03  2023-01-24   13.1   97.5  14.7  NaN
1          Anggun Laili  2018-05-06  2023-01-24   12.2   98.5  14.5  NaN
2          Sivaul Qolbi  2018-06-06  2023-01-24   12.6   95.5  14.7  NaN
3                  Rael  2018-07-03  2023-01-24   14.2   99.3  15.0  NaN
4         SILVIA ANJANI  2018-08-18  2023-01-24   13.2     97  14.7  NaN
..                  ...          ...        ...    ...    ...   ...  ...
620       SAFA ANGGIANA  2022-04-07  2023-01-11    7.0   67.5  13.0  NaN
621                ZOYA  2022-04-14  2023-01-11    7.6   67.5  12.5  NaN
622   TRESNO ADI DHARMA  2022-06-04  2023-01-11    6.5     65  13.3  NaN
623  ERIN CANTIKA PUTRI  2022-06-06  2023-01-11    6.1   65.5  12.8  NaN
624   Najwa Ima Syuhada  2022-11-07  2023-01-11    5.6     60   NaN  NaN

[624 rows x 7 columns]

In [114]:
df_stun.to_excel('Prepros1.xlsx', index=False)